Tekla Open API Reference for Tekla Structures 2025
IHideable.Hideable Property
 Accesses the information if this object is hidden or not or if it should be.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
Hideable Hideable { get; }
ReadOnly Property Hideable As Hideable
	Get
Property Value
Type: Hideable
See Also
Reference
IHideable Interface
Tekla.Structures.Drawing Namespace